Для участия в отборе, необходимо выполнить все 7 заданий и вкоммитать их в git репозиторий ОДНИМ проектом. Ссылка на репозиторий должна быть прикреплена к форме регистрации, в необходимом поле.
Тестовые задания принимаются до 25 июля 2021.
Задание должно быть выполнено на языке Java.
Решение каждой задачи должно лежать в отдельном пакете проекта.
Приветствуется соответствие принципам ООП и сильного сцепления.
Все сообщения должны быть выведены пользователю в консоль, с помощью метода System.out.print(ln).

Задания:

1. Напишите программу, которая возвращает количество "троек" в заданной строке. Тройка - это символ, появляющийся три раза подряд в строке.


2. Напишите программу, которая возвращает сумму цифр, присутствующих в данной строке. Если цифр нет, возвращаемая сумма равна 0.


3. На вход приходят 2 вектора, описанные координатами точек начала (x1,y1) и конца (x2,y2) вектора. Найти длины векторов, а так же вектор произведения первого вектора на второй и второго на первый (получим 2 новых вектора). Векторы выводить в формате “начало (x1,y1), конец (x2,y2).


4. Создать программу, которая будет вычислять и выводить на экран простые множители из которых состоит целое число, введенное пользователем. Если введено не целое число, то сообщать ему об ошибке.


5. Создать программу, которая будет:
- подсчитывать количество гласных в словах;
- выводить слова отсортированные по кол-ву гласных (сперва те у которых больше гласных);
- делать первую гласную букву в слове заглавной.
Предложение вводится вручную. Разделитель пробел (“ ”).
  
6. Создайте программу, которая будет получать число и печатать его в следующем формате ASCII ART
   (формы цифр можно придумать свою, главное чтобы она читалась на экране) Дополнительно: сделайте так, чтобы «большая цифра» состояла не из ‘*’, а из соответствующих маленьких(обычных) цифр.


7. Есть набор предметов, задаётся заранее, предметы могут повторяться. Предмет имеет 2 параметра (обязательных, остальные на усмотрения, типа имя и т.д.), объём (целое значение) и ценность (целое значение). Предметы неделимы. Задаётся размер сейфа, параметром его объёма (целое значение).
Нужно написать программу, которая набивает сейф набором предметов, таким образом чтобы ценность этого набора была максимальной.


Критерии оценки:

1. Работоспособность и соответствие условиям задачи.
2. Оптимальность выбранного решения.
3. Стиль кода.